backend/controllers/IdeaBookController.php

    public function getCountBook()
    {
        $count = IdeaBook::find()->count();
---
SELECT COUNT(*) FROM `tbl_ideabook`