backend/controllers/ProjectController.php

SELECT COUNT(*) FROM `tbl_project`
---
    public function getProjects()
    {
        return Project::find()->count();