backend/controllers/RequestController.php

    public function getRequestDashboards()
    {
        $pedidos = Request::find()
        ->select('tbl_request.status as estado, tbl_request.description as descricao, tbl_request.idRequest, tbl_user.username, tbl_address.address_name, tbl_project.name')
        ->innerJoin('tbl_user', 'tbl_user.idUser = tbl_request.idUser')
        ->innerJoin('tbl_address', 'tbl_address.idAddress = tbl_request.idAddress')
        ->leftJoin('tbl_project', 'tbl_project.idProject = tbl_request.idProject')
        ->limit(10)
        ->orderBy('idRequest desc')
        ->asArray()
        ->all();
---
SELECT `tbl_request`.`status` AS `estado`, `tbl_request`.`description` AS `descricao`, `tbl_request`.`idRequest`, `tbl_user`.`username`, `tbl_address`.`address_name`, `tbl_project`.`name` FROM `tbl_request` INNER JOIN `tbl_user` ON tbl_user.idUser = tbl_request.idUser INNER JOIN `tbl_address` ON tbl_address.idAddress = tbl_request.idAddress LEFT JOIN `tbl_project` ON tbl_project.idProject = tbl_request.idProject ORDER BY `idRequest` DESC LIMIT 10

    public function getRequests()
    {
        return Request::find()->count();
---
SELECT COUNT(*) FROM `tbl_request`

    public function actionCreate()
    {
        if (\Yii::$app->user->can('criarPedido'))
        {
            $model = new Request();
            $image = new Image();
            if ($model->load(Yii::$app->request->post())) {
                $model->save(false);
                if($image->load(Yii::$app->request->post()))
                {
                    $image->file = UploadedFile::getInstances($image, 'file');
                    foreach($image->file as $file)
                    {
                        $image = new Image();
                        $image->name = 'images/' .  preg_replace("/[^a-zA-Z0-9.]/", "",str_replace(' ', '_' , $file->baseName)) . '.' . $file->extension;
                        $image->idRequest = $model->idRequest;
                        $image->isNewRecord = true;
                        $image->save(false);
                        $path = 'images/' .  preg_replace("/[^a-zA-Z0-9.]/", "",str_replace(' ', '_' , $file->baseName)) . '.' . $file->extension;
                        $file->saveAs($path);
---
INSERT INTO `tbl_request` (`description`, `idUser`, `idAddress`, `status`) VALUES ('oij', 5, 1, 'b')
INSERT INTO `tbl_image` (`name`, `idRequest`) VALUES ('images/Diagramadeclasses.png', 18)