backend/controllers/UserController.php

SELECT COUNT(*) FROM `tbl_user`
---
    public function getUsers()
    {
        return User::find()->count();

SELECT * FROM `tbl_user` WHERE `idUser`='31'
---
    public function actionUpdate($id)
    {
        if (\Yii::$app->user->can('atualizarUser'))
        {
            $session = Yii::$app->session;
            $model = $this->findModel($id);
            $session->set('id', $model->idUser);
            $oldImage = $model->photo;

            if ($model->load(Yii::$app->request->post())) {