backend/controllers/UserController.php

SELECT COUNT(tbl_request.idRequest) AS total, `tbl_user`.`username` FROM `tbl_user` RIGHT JOIN `tbl_request` ON tbl_user.idUser = tbl_request.idUser GROUP BY `tbl_request`.`idUser` ORDER BY `total` LIMIT 10
---
    public function getUsersRequestsDashboard()
    {
        $dataUsers = User::find()->select([new Expression('COUNT(tbl_request.idRequest) AS total'), 'tbl_user.username'])
        ->rightJoin('tbl_request', 'tbl_user.idUser = tbl_request.idUser')
        ->orderBy('total asc')
        ->groupBy(['tbl_request.idUser'])
        ->limit(10)
        ->asArray()
        ->all();

SELECT * FROM `tbl_user` WHERE `idUser`='34'
---
    public function actionUpdate($id)
    {
        if (\Yii::$app->user->can('atualizarUser'))
        {
            $session = Yii::$app->session;
            $model = $this->findModel($id);
            $session->set('id', $model->idUser);
            $oldImage = $model->photo;

            if ($model->load(Yii::$app->request->post())) {