backend/models/Admin.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `tbl_admin` WHERE (`id`=1) AND (`status`=10)

    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `tbl_admin` WHERE (`email`='artdecora123@gmail.com') AND (`status`=10)