backend/models/Designerproject.php

    public function getDesigners() {
        $session = Yii::$app->session;
        $projeto = $session->get('projeto');
        $designers = Designer::find()->select('tbl_designer.*')
        ->leftJoin('tbl_designerproject','tbl_designer.idDesigner = tbl_designerproject.idDesigner')
        ->where(['tbl_designerproject.idProject' => NULL])
        ->all();
---
SELECT `tbl_designer`.* FROM `tbl_designer` LEFT JOIN `tbl_designerproject` ON tbl_designer.idDesigner = tbl_designerproject.idDesigner WHERE NOT (tbl_designerproject.idProject=187)
SELECT `tbl_designer`.* FROM `tbl_designerproject` RIGHT JOIN `tbl_designer` ON tbl_designer.idDesigner = tbl_designerproject.idDesigner WHERE `tbl_designerproject`.`idProject` <> 187