backend/views/project/_form.php

    if($project->isNewRecord)
    {
        ?>
        <?php $designers = ArrayHelper::map(\backend\models\Designer::find()->orderBy('idDesigner')->all(), 'idDesigner', 'name')?>
---
SELECT * FROM `tbl_designer` ORDER BY `idDesigner`

            ],
        ]);?>

        <?php $categorias = ArrayHelper::map(\backend\models\Category::find()->orderBy('idCategory')->all(), 'idCategory', 'name')?>
---
SELECT * FROM `tbl_category` ORDER BY `idCategory`